old/session_two.org
#+REVEAL_THEME: white

#+REVEAL_TITLE_SLIDE_BACKGROUND: logo.png
#+REVEAL_TITLE_SLIDE_BACKGROUND_SIZE: 1080px

#+Title: Session 2
#+Author: Rodda John
#+Email: rj2485[at]columbia[dot]edu

#+OPTIONS: date:t creator:t
#+OPTIONS: toc:nil

#+REVEAL_PLUGINS: (highlight)

* Let's Talk
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  
  #+ATTR_REVEAL: :frag (appear)
  - How's life everyone?
  - Outstanding questions from yesterday?
  - Random CS related questions?

* Functions
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+ATTR_REVEAL: :frag (appear)
  - What is a function?
  - Why are they useful?
  - Consider:
    #+BEGIN_SRC python
      def add(x, y):
	  return x + y
    #+END_SRC
  - How would we call this function?
  - Answer:
    #+BEGIN_SRC python
      add(x, y)
    #+END_SRC

** Some exercises:
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  
  But first...
  #+ATTR_REVEAL: :frag (appear)
  - The ~%~ operator
  - Operates on two numbers, returns the remainder
  - What is ~3 % 4~
  - ~4 % 4~
  - ~4 % 5~
  - ~'a' % 1~
** Let's write 3 functions
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  1) ~divisible_by(x, y)~
     1) Returns ~True~ if ~x~ is divisible by ~y~, ~False~ if not
  2) ~num_factors(x)~
     1) Returns the number of factors that ~x~ has
  3) ~is_prime(x)~
     1) Returns ~True~ if ~x~ is prime, ~False~ if not

  #+ATTR_REVEAL: :frag (appear)
  - To test the functions, please see below:
    
    #+BEGIN_SRC python
      divisible_by(10, 2) # Should return True
      divisible_by(10, 3) # Should return False

      num_factors(4) # Should be 3
      num_factors(5) # Should be 2

      is_prime(3) # Should be True
      is_prime(6) # Should be False
    #+END_SRC
*** ~divisible_by(x, y)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+ATTR_REVEAL: :frag (appear)
  - You probably have something like:
    #+BEGIN_SRC python
      def divisible_by(x, y):
	  if (x % y == 0):
	      return True
	  else:
	      return False
    #+END_SRC

  - But you could also have:
    #+BEGIN_SRC python
      def divisible_by(x, y):
	  if (x % y == 0):
	      return True
	  return False
    #+END_SRC

  - Or even:
    #+BEGIN_SRC python
      def divisible_by(x, y):
  	return x % y == 0
    #+END_SRC
*** ~num_factors(x)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+ATTR_REVEAL: :frag (appear)
  - You may have something like this:
    #+BEGIN_SRC python
      def num_factors(x):
	  i = 0
	  num_factors = 0

	  while i <= x:
	      if divisible_by(x, i):
		  num_factors += 1
	      i += 1

	  return num_factors
    #+END_SRC

  - How about something like this:
    #+BEGIN_SRC python
      def num_factors(x):
	  num_factors = 0

	  for i in range(1, x + 1):
	      if divisible_by(x, i):
		  num_factors += 1

	  return num_factors
    #+END_SRC
*** ~is_prime(x)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+ATTR_REVEAL: :frag (appear)
  - You probably have something like this:
    #+BEGIN_SRC python
      def is_prime(x):
	  if num_factors(x) == 2:
	      return True
	  return False
    #+END_SRC
  - But you could also have:
    #+BEGIN_SRC python
      def is_prime(x):
	  return num_factors(x) == 2
    #+END_SRC
  - Is 1 a prime number?

* Lists
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  Let's review

  #+ATTR_REVEAL: :frag (appear)
  - What is a list?
  - How can we access an element in a list?
  - What is the first element in a list's index?
  - How can we get the length of a list?
  - Is a string a list?
** Let's write some code!
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  1) ~average(l)~
     1) Assume l is a list of numbers, find the average of all elements
  2) ~has_prime(l)~
     1) Returns ~True~ if the list has a prime number, ~False~ if not
  3) ~contains(l, e)~
     1) Returns ~True~ if ~l~ contains ~e~, ~False~ if not

  #+REVEAL: split
  To test the functions, please see below:
    
    #+BEGIN_SRC python
      l_one = [1, 3, 5, 7, 9]
      l_two = [4, 6, 8, 10, 12]

      average(l_one) # Should be 5
      average(l_two) # Should be 8

      has_prime(l_one) # Should be True
      has_prime(l_two) # Should be False

      contains(l_one, 5) # Should be True
      contains(l_two, 5) # Should be False
    #+END_SRC
*** ~average(l)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  Seems familiar?
    
  #+ATTR_REVEAL: :frag (appear)
  - You may have something that looks like this:
    #+BEGIN_SRC python
      def average(l):
	  current_sum = 0

	  for e in l:
	      current_sum += e

	  return current_sum / len(l)
    #+END_SRC
  - You could also have used something like:
    #+BEGIN_SRC python
      def average(l):
	  return sum(l) / len(l)
    #+END_SRC

*** ~has_prime(l)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
    
  #+ATTR_REVEAL: :frag (appear)
  - You may have something that looks like this:
    #+BEGIN_SRC python
      def has_prime(l):
	  has_prime_num = False
    
	  for e in l:
	      if is_prime(e):
		  has_prime_num = True

	  return has_prime_num
    #+END_SRC
  - You could also have used something like:
    #+BEGIN_SRC python
      def has_prime(l):
	  for e in l:
	      if is_prime(e):
		  return True
        
	  return False
    #+END_SRC

