old/session_two.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Session 2</title>
<meta name="author" content="(Rodda John)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/white.css" id="theme"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="logo.png" data-background-size="1080px"><h1 class="title">Session 2</h1><h2 class="author">Rodda John</h2><p class="date">Created: 2019-06-24 Mon 10:02</p>
</section>

<section>
<section id="slide-org353b47a" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h2 id="org353b47a"><span class="section-number-2">1</span> Let's Talk</h2>
<ul>
<li class="fragment appear">How's life everyone?</li>
<li class="fragment appear">Outstanding questions from yesterday?</li>
<li class="fragment appear">Random CS related questions?</li>

</ul>

</section>
</section>
<section>
<section id="slide-org6a005e4" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h2 id="org6a005e4"><span class="section-number-2">2</span> Functions</h2>
<ul>
<li class="fragment appear">What is a function?</li>
<li class="fragment appear">Why are they useful?</li>
<li class="fragment appear"><p>
Consider:
</p>
<div class="org-src-container">

<pre><code class="python" >def add(x, y):
    return x + y
</code></pre>
</div></li>
<li class="fragment appear">How would we call this function?</li>
<li class="fragment appear"><p>
Answer:
</p>
<div class="org-src-container">

<pre><code class="python" >add(x, y)
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-org9610e23" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="org9610e23"><span class="section-number-3">2.1</span> Some exercises:</h3>
<p>
But first&#x2026;
</p>
<ul>
<li class="fragment appear">The <code>%</code> operator</li>
<li class="fragment appear">Operates on two numbers, returns the remainder</li>
<li class="fragment appear">What is <code>3 % 4</code></li>
<li class="fragment appear"><code>4 % 4</code></li>
<li class="fragment appear"><code>4 % 5</code></li>
<li class="fragment appear"><code>'a' % 1</code></li>

</ul>
</section>
<section id="slide-org934f087" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="org934f087"><span class="section-number-3">2.2</span> Let's write 3 functions</h3>
<ol>
<li><code>divisible_by(x, y)</code>
<ol>
<li>Returns <code>True</code> if <code>x</code> is divisible by <code>y</code>, <code>False</code> if not</li>

</ol></li>
<li><code>num_factors(x)</code>
<ol>
<li>Returns the number of factors that <code>x</code> has</li>

</ol></li>
<li><code>is_prime(x)</code>
<ol>
<li>Returns <code>True</code> if <code>x</code> is prime, <code>False</code> if not</li>

</ol></li>

</ol>

<ul>
<li class="fragment appear"><p>
To test the functions, please see below:
</p>

<div class="org-src-container">

<pre><code class="python" >divisible_by(10, 2) # Should return True
divisible_by(10, 3) # Should return False

num_factors(4) # Should be 3
num_factors(5) # Should be 2

is_prime(3) # Should be True
is_prime(6) # Should be False
</code></pre>
</div></li>

</ul>
</section>
<section id="slide-org5fbd61e" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="org5fbd61e"><span class="section-number-4">2.2.1</span> <code>divisible_by(x, y)</code></h4>
<ul>
<li class="fragment appear"><p>
You probably have something like:
</p>
<div class="org-src-container">

<pre><code class="python" >def divisible_by(x, y):
    if (x % y == 0):
	return True
    else:
	return False
</code></pre>
</div></li>

<li class="fragment appear"><p>
But you could also have:
</p>
<div class="org-src-container">

<pre><code class="python" >def divisible_by(x, y):
    if (x % y == 0):
	return True
    return False
</code></pre>
</div></li>

<li class="fragment appear"><p>
Or even:
</p>
<div class="org-src-container">

<pre><code class="python" >def divisible_by(x, y):
  return x % y == 0
</code></pre>
</div></li>

</ul>
</section>
<section id="slide-orge1c4d33" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="orge1c4d33"><span class="section-number-4">2.2.2</span> <code>num_factors(x)</code></h4>
<ul>
<li class="fragment appear"><p>
You may have something like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def num_factors(x):
    i = 0
    num_factors = 0

    while i <= x:
	if divisible_by(x, i):
	    num_factors += 1
	i += 1

    return num_factors
</code></pre>
</div></li>

<li class="fragment appear"><p>
How about something like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def num_factors(x):
    num_factors = 0

    for i in range(1, x + 1):
	if divisible_by(x, i):
	    num_factors += 1

    return num_factors
</code></pre>
</div></li>

</ul>
</section>
<section id="slide-orgddc122a" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="orgddc122a"><span class="section-number-4">2.2.3</span> <code>is_prime(x)</code></h4>
<ul>
<li class="fragment appear"><p>
You probably have something like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def is_prime(x):
    if num_factors(x) == 2:
	return True
    return False
</code></pre>
</div></li>
<li class="fragment appear"><p>
But you could also have:
</p>
<div class="org-src-container">

<pre><code class="python" >def is_prime(x):
    return num_factors(x) == 2
</code></pre>
</div></li>
<li class="fragment appear">Is 1 a prime number?</li>

</ul>

</section>
</section>
<section>
<section id="slide-org7716cbf" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h2 id="org7716cbf"><span class="section-number-2">3</span> Lists</h2>
<p>
Let's review
</p>

<ul>
<li class="fragment appear">What is a list?</li>
<li class="fragment appear">How can we access an element in a list?</li>
<li class="fragment appear">What is the first element in a list's index?</li>
<li class="fragment appear">How can we get the length of a list?</li>
<li class="fragment appear">Is a string a list?</li>

</ul>
</section>
<section id="slide-orgc3c6620" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="orgc3c6620"><span class="section-number-3">3.1</span> Let's write some code!</h3>
<ol>
<li><code>average(l)</code>
<ol>
<li>Assume l is a list of numbers, find the average of all elements</li>

</ol></li>
<li><code>has_prime(l)</code>
<ol>
<li>Returns <code>True</code> if the list has a prime number, <code>False</code> if not</li>

</ol></li>
<li><code>contains(l, e)</code>
<ol>
<li>Returns <code>True</code> if <code>l</code> contains <code>e</code>, <code>False</code> if not</li>

</ol></li>

</ol>

</section>
<section  data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<p>
To test the functions, please see below:
</p>

<div class="org-src-container">

<pre><code class="python" >l_one = [1, 3, 5, 7, 9]
l_two = [4, 6, 8, 10, 12]

average(l_one) # Should be 5
average(l_two) # Should be 8

has_prime(l_one) # Should be True
has_prime(l_two) # Should be False

contains(l_one, 5) # Should be True
contains(l_two, 5) # Should be False
</code></pre>
</div>
</section>
<section id="slide-org415dbbe" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="org415dbbe"><span class="section-number-4">3.1.1</span> <code>average(l)</code></h4>
<p>
Seems familiar?
</p>

<ul>
<li class="fragment appear"><p>
You may have something that looks like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def average(l):
    current_sum = 0

    for e in l:
	current_sum += e

    return current_sum / len(l)
</code></pre>
</div></li>
<li class="fragment appear"><p>
You could also have used something like:
</p>
<div class="org-src-container">

<pre><code class="python" >def average(l):
    return sum(l) / len(l)
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-orge22c4f8" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="orge22c4f8"><span class="section-number-4">3.1.2</span> <code>has_prime(l)</code></h4>
<ul>
<li class="fragment appear"><p>
You may have something that looks like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def has_prime(l):
    has_prime_num = False

    for e in l:
	if is_prime(e):
	    has_prime_num = True

    return has_prime_num
</code></pre>
</div></li>
<li class="fragment appear"><p>
You could also have used something like:
</p>
<div class="org-src-container">

<pre><code class="python" >def has_prime(l):
    for e in l:
	if is_prime(e):
	    return True

    return False
</code></pre>
</div></li>

</ul>

</section>
