old/session_two.org
*** ~contains(l, e)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
    
  #+ATTR_REVEAL: :frag (appear)
  - You may have something that looks like this:
    #+BEGIN_SRC python
      def contains(l, e):
	  for elem in l:
	      if elem == e:
		  return True
	  return False
    #+END_SRC
  - You could also have used something like:
    #+BEGIN_SRC python
      def contains(l, e):
	  i = 0
	  while i < len(l):
	      if l[i] == e:
		  return True
	      i += 1
	  return False
    #+END_SRC
  - Or, how about something like this:
    #+BEGIN_SRC python
      def contains(l, e):
	  return e in l
    #+END_SRC
** Just to be sure:
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

   Try this one out:
   
   #+ATTR_REVEAL: :frag (appear)
   1) Write a function (~count_evens(l)~) which returns the number of even ints in the given array.

   2) Use the following to test:
      #+BEGIN_SRC python
	count_evens([2, 1, 2, 3, 4]) # Should be 3
	count_evens([2, 2, 0]) # Should be 3
	count_evens([1, 3, 5]) # Should be 0
      #+END_SRC
*** Solutions for ~count_evens(l)~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+ATTR_REVEAL: :frag (appear)
  - Hmmmmm, how about something like this?
    #+BEGIN_SRC python
      def count_evens(l):
	  num_evens = 0

	  for e in l:
	      if e % 2 == 0:
		  num_evens += 1

	  return num_evens
    #+END_SRC

  - 
    #+BEGIN_SRC python
      def is_even(n):
	  return n % 2 == 0

      def count_evens(l):
	  num_evens = 0

	  for e in l:
	      if is_even(e):
		  num_evens += 1

	  return num_evens
    #+END_SRC

** Cool List Operations
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  
  First predict, then try, then analyze...

  #+ATTR_REVEAL: :frag (appear)
  - Given the following list:
    - ~l = [0, 7, 3, 4, 5, 2, 1]~
  - ~list[-1]~, ~list[-2]~
  - ~list[0:2]~, ~list[1:3]~
  - ~list[:2]~, ~list[2:]~

* File I/O
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  Reading and writing to files.
  [[https://github.com/roddajohn/hypothekids]]
  #+ATTR_REVEAL: :frag (appear)
  - What is a file?
  - Guesses as to what a ~.csv~ is?
  - Are there any differences between what's in one file and what's in another?

** Python Examples
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  Some work...
  #+ATTR_REVEAL: :frag (appear)
  - What does ~split()~ do?
  - How about ~join()~?
  - Write an example or two, play with it...

*** ~split()~ and ~join()~
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  Here's an example:

    #+BEGIN_SRC python
      string_to_parse = 'name,email,age,birthday'

      parsed_on_comma = string_to_parse.split(',')
      print(parsed_on_comma)

      recombined = ','.join(parsed_on_comma)
      print(recombined)
    #+END_SRC

    #+ATTR_REVEAL: :frag (appear)
    - What datatype is ~string_to_parse~?
    - How about ~parsed_on_comma~?
    - And ~recombined~?
    - What would ~parsed_on_comma.split('')~ return?
** Now for some file work
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

   File: ~data1.csv~

   #+ATTR_REVEAL: :frag (appear)
   - A snippet:
     #+BEGIN_SRC python
       file_contents = open('data1.csv').read()

       lines_as_array = file_contents.split('\n')
     #+END_SRC

   - The file looks like this:
     | Name        | Email        | Age | Birthday   |
     |-------------+--------------+-----+------------|
     | random name | random email |  -1 | 08/16/1999 |

   - Print out every person's name, email, age, and birthday
*** An example
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+BEGIN_SRC python
    file_contents = open('data1.csv').read()

    lines_as_array = file_contents.split('\n')

    for line in lines_as_array:
	if line == '':
	    continue
    
	split_data = line.split(',')

	print ('Name: ' + split_data[0] + 
	       ', email: ' + split_data[1] + 
	       ', age: ' + split_data[2] +
	       ', birthday: ' + split_data[3])

    print ('Read ' + str(len(lines_as_array)) + ' people')
  #+END_SRC
** Another one...
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:
  File ~data2.csv~
  
  #+ATTR_REVEAL: :frag (appear)
  - File looks like:
    | ID | XCORD | YCORD | ZCORD |   DX |   DY |   DZ |
    |----+-------+-------+-------+------+------+------|
    |  1 |     1 |     2 |     3 | 1.43 | 2.87 | -918 |
    |  2 |     7 |     6 |     3 | -1.2 | 2.67 |  713 |

  - Find the:
    - Average ~xcord~, average ~ycord~, average ~zcord~, etc
    - For every three coordinates (three rows), print the midpoint before and after change
*** Part 1
  :PROPERTIES:
  :reveal_background: logo.png
  :reveal_background_size: 1080px
  :reveal_background_trans: slide
  :END:

  #+BEGIN_SRC python
    f = open('data2.csv').read().split('\n')

    sums = [0, 0, 0, 0, 0, 0, 0]

    for line in f:
	split = f.split(',')

	i = 0
	for i in range(len(split)):
	    sums[i] += split[i]

    i = 0
    for i in range(len(sums)):
	print(str(i) + 'th index avg is: ' + str(sums[i] / len(f)))

  #+END_SRC

