old/session_two.html
<section id="slide-orge27f843" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="orge27f843"><span class="section-number-4">3.1.3</span> <code>contains(l, e)</code></h4>
<ul>
<li class="fragment appear"><p>
You may have something that looks like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def contains(l, e):
    for elem in l:
	if elem == e:
	    return True
    return False
</code></pre>
</div></li>
<li class="fragment appear"><p>
You could also have used something like:
</p>
<div class="org-src-container">

<pre><code class="python" >def contains(l, e):
    i = 0
    while i < len(l):
	if l[i] == e:
	    return True
	i += 1
    return False
</code></pre>
</div></li>
<li class="fragment appear"><p>
Or, how about something like this:
</p>
<div class="org-src-container">

<pre><code class="python" >def contains(l, e):
    return e in l
</code></pre>
</div></li>

</ul>
</section>
<section id="slide-orgf2bb610" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="orgf2bb610"><span class="section-number-3">3.2</span> Just to be sure:</h3>
<p>
Try this one out:
</p>

<ol>
<li class="fragment appear">Write a function (<code>count_evens(l)</code>) which returns the number of even ints in the given array.</li>

<li class="fragment appear"><p>
Use the following to test:
</p>
<div class="org-src-container">

<pre><code class="python" >count_evens([2, 1, 2, 3, 4]) # Should be 3
count_evens([2, 2, 0]) # Should be 3
count_evens([1, 3, 5]) # Should be 0
</code></pre>
</div></li>

</ol>
</section>
<section id="slide-org8f81602" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="org8f81602"><span class="section-number-4">3.2.1</span> Solutions for <code>count_evens(l)</code></h4>
<ul>
<li class="fragment appear"><p>
Hmmmmm, how about something like this?
</p>
<div class="org-src-container">

<pre><code class="python" >def count_evens(l):
    num_evens = 0

    for e in l:
	if e % 2 == 0:
	    num_evens += 1

    return num_evens
</code></pre>
</div></li>

<li class="fragment appear"><div class="org-src-container">

<pre><code class="python" >def is_even(n):
    return n % 2 == 0

def count_evens(l):
    num_evens = 0

    for e in l:
	if is_even(e):
	    num_evens += 1

    return num_evens
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-org64d1e16" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="org64d1e16"><span class="section-number-3">3.3</span> Cool List Operations</h3>
<p>
First predict, then try, then analyze&#x2026;
</p>

<ul>
<li class="fragment appear">Given the following list:
<ul>
<li><code>l = [0, 7, 3, 4, 5, 2, 1]</code></li>

</ul></li>
<li class="fragment appear"><code>list[-1]</code>, <code>list[-2]</code></li>
<li class="fragment appear"><code>list[0:2]</code>, <code>list[1:3]</code></li>
<li class="fragment appear"><code>list[:2]</code>, <code>list[2:]</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org2c44849" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h2 id="org2c44849"><span class="section-number-2">4</span> File I/O</h2>
<p>
Reading and writing to files.
<a href="https://github.com/roddajohn/hypothekids">https://github.com/roddajohn/hypothekids</a>
</p>
<ul>
<li class="fragment appear">What is a file?</li>
<li class="fragment appear">Guesses as to what a <code>.csv</code> is?</li>
<li class="fragment appear">Are there any differences between what's in one file and what's in another?</li>

</ul>

</section>
<section id="slide-orgbe9a79a" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="orgbe9a79a"><span class="section-number-3">4.1</span> Python Examples</h3>
<p>
Some work&#x2026;
</p>
<ul>
<li class="fragment appear">What does <code>split()</code> do?</li>
<li class="fragment appear">How about <code>join()</code>?</li>
<li class="fragment appear">Write an example or two, play with it&#x2026;</li>

</ul>

</section>
<section id="slide-org0aa7257" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="org0aa7257"><span class="section-number-4">4.1.1</span> <code>split()</code> and <code>join()</code></h4>
<p>
Here's an example:
</p>

<div class="org-src-container">

<pre><code class="python" >string_to_parse = 'name,email,age,birthday'

parsed_on_comma = string_to_parse.split(',')
print(parsed_on_comma)

recombined = ','.join(parsed_on_comma)
print(recombined)
</code></pre>
</div>

<ul>
<li class="fragment appear">What datatype is <code>string_to_parse</code>?</li>
<li class="fragment appear">How about <code>parsed_on_comma</code>?</li>
<li class="fragment appear">And <code>recombined</code>?</li>
<li class="fragment appear">What would <code>parsed_on_comma.split('')</code> return?</li>

</ul>
</section>
<section id="slide-org88d7aa8" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="org88d7aa8"><span class="section-number-3">4.2</span> Now for some file work</h3>
<p>
File: <code>data1.csv</code>
</p>

<ul>
<li class="fragment appear"><p>
A snippet:
</p>
<div class="org-src-container">

<pre><code class="python" >file_contents = open('data1.csv').read()

lines_as_array = file_contents.split('\n')
</code></pre>
</div></li>

<li class="fragment appear"><p>
The file looks like this:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Email</th>
<th scope="col" class="org-right">Age</th>
<th scope="col" class="org-left">Birthday</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">random name</td>
<td class="org-left">random email</td>
<td class="org-right">-1</td>
<td class="org-left">08/16/1999</td>
</tr>
</tbody>
</table></li>

<li class="fragment appear">Print out every person's name, email, age, and birthday</li>

</ul>
</section>
<section id="slide-org7b05644" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="org7b05644"><span class="section-number-4">4.2.1</span> An example</h4>
<div class="org-src-container">

<pre><code class="python" >file_contents = open('data1.csv').read()

lines_as_array = file_contents.split('\n')

for line in lines_as_array:
    if line == '':
	continue

    split_data = line.split(',')

    print ('Name: ' + split_data[0] + 
	   ', email: ' + split_data[1] + 
	   ', age: ' + split_data[2] +
	   ', birthday: ' + split_data[3])

print ('Read ' + str(len(lines_as_array)) + ' people')
</code></pre>
</div>
</section>
<section id="slide-org3a114e7" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h3 id="org3a114e7"><span class="section-number-3">4.3</span> Another one&#x2026;</h3>
<p>
File <code>data2.csv</code>
</p>

<ul>
<li class="fragment appear"><p>
File looks like:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID</th>
<th scope="col" class="org-right">XCORD</th>
<th scope="col" class="org-right">YCORD</th>
<th scope="col" class="org-right">ZCORD</th>
<th scope="col" class="org-right">DX</th>
<th scope="col" class="org-right">DY</th>
<th scope="col" class="org-right">DZ</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">1.43</td>
<td class="org-right">2.87</td>
<td class="org-right">-918</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">3</td>
<td class="org-right">-1.2</td>
<td class="org-right">2.67</td>
<td class="org-right">713</td>
</tr>
</tbody>
</table></li>

<li class="fragment appear">Find the:
<ul>
<li>Average <code>xcord</code>, average <code>ycord</code>, average <code>zcord</code>, etc</li>
<li>For every three coordinates (three rows), print the midpoint before and after change</li>

</ul></li>

</ul>
</section>
<section id="slide-orgc61ef31" data-background="logo.png" data-background-size="1080px" data-background-transition="slide">
<h4 id="orgc61ef31"><span class="section-number-4">4.3.1</span> Part 1</h4>
<div class="org-src-container">

<pre><code class="python" >f = open('data2.csv').read().split('\n')

sums = [0, 0, 0, 0, 0, 0, 0]

for line in f:
    split = f.split(',')

    i = 0
    for i in range(len(split)):
	sums[i] += split[i]

i = 0
for i in range(len(sums)):
    print(str(i) + 'th index avg is: ' + str(sums[i] / len(f)))

</code></pre>
</div>

</section>
